In [3]:
import numpy as np 
import pandas as pd

In [4]:
data_set=pd.read_excel("stress.xlsx")
data_set

   s.no name  age  traditional educational approach  stress of exams
0     1    a   19                               1.0              1.0
1     2    b   20                               NaN              NaN
2     3    c   19                               1.0              1.0
3     4    d   20                               0.0              0.0
4     5    e   18                               0.0              1.0

In [5]:
data_set.dropna()

   s.no name  age  traditional educational approach  stress of exams
0     1    a   19                               1.0              1.0
2     3    c   19                               1.0              1.0
3     4    d   20                               0.0              0.0
4     5    e   18                               0.0              1.0

In [6]:
data_set.dropna(axis=1)

   s.no name  age
0     1    a   19
1     2    b   20
2     3    c   19
3     4    d   20
4     5    e   18

In [7]:
data_set.fillna(100,axis=1)

  s.no name age traditional educational approach stress of exams
0    1    a  19                              1.0             1.0
1    2    b  20                              100             100
2    3    c  19                              1.0             1.0
3    4    d  20                              0.0             0.0
4    5    e  18                              0.0             1.0

In [8]:
data_set.dropna(thresh=4)

   s.no name  age  traditional educational approach  stress of exams
0     1    a   19                               1.0              1.0
2     3    c   19                               1.0              1.0
3     4    d   20                               0.0              0.0
4     5    e   18                               0.0              1.0

In [9]:
data_set.fillna(100)

   s.no name  age  traditional educational approach  stress of exams
0     1    a   19                               1.0              1.0
1     2    b   20                             100.0            100.0
2     3    c   19                               1.0              1.0
3     4    d   20                               0.0              0.0
4     5    e   18                               0.0              1.0

In [10]:
m=data_set['stress of exams'].mean()
m

0.75

In [11]:
data_set['stress of exams'].fillna(value=m)

0    1.00
1    0.75
2    1.00
3    0.00
4    1.00
Name: stress of exams, dtype: float64

In [7]:
me=data_set['stress of exams'].median()
me

1.0

In [14]:
data_set.fillna(value=me)

   s.no name  age  traditional educational approach  stress of exams
0     1    a   19                               1.0              1.0
1     2    b   20                               1.0              1.0
2     3    c   19                               1.0              1.0
3     4    d   20                               0.0              0.0
4     5    e   18                               0.0              1.0

In [21]:
mo=data_set['stress of exams'].mode()
mo

0    1.0
Name: stress of exams, dtype: float64

In [24]:
data_set.fillna(value=mo[0])

   s.no name  age  traditional educational approach  stress of exams
0     1    a   19                               1.0              1.0
1     2    b   20                               1.0              1.0
2     3    c   19                               1.0              1.0
3     4    d   20                               0.0              0.0
4     5    e   18                               0.0              1.0

In [13]:
data_set['stress of exams'].fillna(value=me)

0    1.0
1    1.0
2    1.0
3    0.0
4    1.0
Name: stress of exams, dtype: float64

In [25]:
data_set['name'].nunique()

5

In [26]:
data_set['name'].unique()

array(['a', 'b', 'c', 'd', 'e'], dtype=object)